src/stage-1-prototype/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
	</Document>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СвязиЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/Documents/ЗаказКлиента/Forms/ФормаСписка/Ext/Form/Module.bsl
// Прототип колонки: стандартный запрос и штатные поля списка не меняются.
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш1_ПриСозданииСпискаНаСервере(Отказ, СтандартнаяОбработка)
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    ПолеЗадачи = ЭтаФорма["Список"].ВычисляемыеПоля.Добавить();
    ПолеЗадачи.ПутьКДанным = "Расш1_ЗадачаId";
    ПолеЗадачи.Выражение = """""";
    ПолеЗадачи.ТипЗначения = Новый ОписаниеТипов("Строка");
    ПолеЗадачи.Заголовок = "Задача Б24";
    Колонка = Элементы.Вставить("Расш1_ЗадачаБ24", Тип("ПолеФормы"), Элементы.Список, Элементы.СписокПриоритет);
    Колонка.Вид = ВидПоляФормы.ПолеНадписи;
    Колонка.ПутьКДанным = "Список.Расш1_ЗадачаId";
    Колонка.Заголовок = "Задача Б24";
    Колонка.ТолькоПросмотр = Истина;
    Колонка.Ширина = 15;
    Элементы.Список.УстановитьДействие("ПриПолученииДанныхНаСервере", "Расш1_СписокПриПолученииДанныхНаСервере");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Расш1_СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
    Ключи = Строки.ПолучитьКлючи();
    Связи = Новый Соответствие;
    Запрос = Новый Запрос("ВЫБРАТЬ Заказ, ЗадачаId
        |ИЗ РегистрСведений.Расш1_СвязиЗаказовБ24
        |ГДЕ Заказ В (&Заказы)");
    Запрос.УстановитьПараметр("Заказы", Ключи);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Связи.Вставить(Выборка.Заказ, Выборка.ЗадачаId);
    КонецЦикла;
    Для Каждого Ключ Из Ключи Цикл
        ЗадачаId = Связи.Получить(Ключ);
        ТекстЗадачи = "";
        Если ЗадачаId <> Неопределено Тогда
            ТекстЗадачи = "Задача №" + ЗадачаId;
        КонецЕсли;
        СтрокаСписка = Строки.Получить(Ключ);
        ОформлениеЗадачи = СтрокаСписка.Оформление.Получить("Расш1_ЗадачаId");
        ОформлениеЗадачи.УстановитьЗначениеПараметра("Текст", ТекстЗадачи);
    КонецЦикла;
КонецПроцедуры
